title: Suspicious Use of Certutil to Download File Windows
id: ea1ee75f-089e-45e3-babf-ce49b838ad38
description: Detects usage of certutil.exe with arguments suggesting a file download
date: 2025-04-16
author: Tobias Thoren
status: experimental
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 1
    Image|endswith: '\certutil.exe'
    CommandLine|contains:
      - '-urlcache'
      - '-split'
  condition: selection
fields:
  - CommandLine
  - ParentImage
  - User
falsepositives:
  - Legitimate system diagnostics (rare)
level: medium
tags:
  - attack.persistence
  - attack.command-and-control
  - attack.t1105
