title: IFEO As Persistence Mechanism
id: 122f1b64-be42-4dff-b8af-968a9e98e256
status: experimental
description: Looks for modifications related to unusual persistence using IFEO.
author: Tobias Thoren
date: 2025-05-05
logsource:
  category: registry_event
  product: windows
detection:
  selection_ifeo:
    TargetObject|contains: 'Image File Execution Options'
    TargetObject|contains|all:
      - '\\SOFTWARE\\Microsot\\Windows NT\\CurrentVersion\\Image File Execution Options\\'
      - 'Debugger'

  filter_known_good:
    Image|contains:
      - 'c:\\Windows\\system32\\svchost.exe'
      - 'c:\\windows\\system32\\services.exe'

  condition: selection_ifeo and not filter_known_good
fields:
  - EventID
  - Image
  - TargetObject
  - Details
  - User
falsepositives:
  - Software with unusually deep integration. Debugging tools for example.
level: high
tags:
  - attack.persistence
  - attack.t1546.012