title: New-Object Net WebClient Download - AnyDesk Script Block
id: 66dc5899-c8ce-4fec-850b-e9aefb361909
status: experimental
description: |
  Downloading AnyDesk as seen in Fog group's any.ps1 powershell script which uses new-object System.Net.WebClient to
  download AnyDesk for persistence.
references:
  - https://thedfirreport.com/2025/04/28/navigating-through-the-fog/
author: Tobias Thoren
date: 2025-04-30
tags:
  - attack.t1133
logsource:
  product: windows
  service: powershell
detection:
  selection:
    ScriptBlockText|contains|all:
      - 'new-object'
      - 'system.net.webclient'
    ScriptBlockText|contains:
      - 'anydesk'
      - 'anydesk.exe'
  condition: selection
falsepositives:
  - Legitimate help-desk install of AnyDesk via scripted deployment
level: high
